<template>
  <div class="row justify-content-center">
    <div class="col-11 col-md-8">
      <div class="rule-card">
        <div class="rule-card-body">
          <h1>ПОДГОТОВКА К ИГРЕ</h1>
          <div>Игроки делятся на две команды, равные по силе и количеству.</div>
          <div>Для стандартной игры потребуется минимум четыре человека (две команды по
            два игрока).
          </div>

          <div>Каждая команда выбирает себе капитана. Оба капитана садятся с одной
            стороны стола, все остальные игроки садятся напротив.
          </div>

          <div>Случайным образом выберается 25 карточек с кодовыми именами
            и вылокладываются на столе в виде сетки 5&nbsp;×&nbsp;5.
          </div>


          <h3>КЛЮЧ</h3>
          <div>В каждой игре имеется ключ, раскрывающий тайные личности карточек, выложенных на столе.
            Ключ известен только капитанам. Игроки не должны видеть ключ.
          </div>
          <div>Этот ключ соответствует сетке карточек, выложенных на столе. Синие карточки обозначают
            кодовые имена, которые должна отгадать синяя команда. Красные карточки обозначают
            кодовые имена, которые должна отгадать красная команда. Серые карточки&nbsp;— это мирные
            жители, а черная карточка&nbsp;— это убийца, с которым ни в коем случае нельзя сталкиваться!
          </div>

          <h3 class="pt-3">ПЕРВЫЙ ХОД</h3>
          <div>Красная команда начинает игру. Команда, которая ходит первой, должна отгадать 9 кодовых
            имен, второй команде необходимо отгадать 8 кодовых имен. Капитан команды,
            начинающей игру, дает первую подсказку.
          </div>
        </div>
      </div>


      <div class="rule-card mt-5">
        <div class="rule-card-body">
          <h1 class="text-center">СУТЬ ИГРЫ</h1>
          <div>Капитаны знают тайные личности 25 агентов. Игроки же знают агентов только по их кодовым
            именам.
          </div>
          <div>Капитаны по очереди дают подсказки, состоящие из одного слова. Слово может относиться к
            нескольким кодовым именам, выложенным на столе. Игроки пытаются отгадать кодовые имена,
            которые имеет в виду их капитан.
            Как только игрок касается карточки (кликает) с кодовым именем,
            раскрывается тайная личность этого кодового имени. Если это агент, относящийся к их
            команде, игроки продолжают отгадывать, пока не ошибутся или не израсходуют свои попытки.
            Команда, которой первой удалось найти всех своих агентов, выигрывает.
          </div>
        </div>
      </div>

      <div class="rule-card mt-5">
        <div class="rule-card-body">
          <h1>ХОД ИГРЫ</h1>
          <div>Команды ходят по очереди. Первой всегда ходит красная команда.</div>
          <h3>ПОДСКАЗКИ</h3>
          <div>Если вы капитан, вам необходимо придумать одно ключевое слово, относящееся к нескольким
            кодовым именам, которые ваша команда должна отгадать. Как только вы придумали
            подходящее слово, вы произносите его вслух. Вы также называете число, которое обозначает
            количество кодовых имен, относящихся к данной подсказке.
          </div>
          <div class="text-marked"><b>Пример:</b> кодовые имена вашей команды&nbsp;— ПАЧКА и ТАНЕЦ.
            Оба этих кодовых имени можно отнести к балету, поэтому вы говорите
            <span class="text-marked"><b><i>«Балет:&nbsp;2»</i></b>.</span>
          </div>
          <div>Вы можете давать подсказку и для одного кодового имени
            (<span class="text-marked"><b><i>Юбка:&nbsp;1</i></b></span>), но гораздо интереснее
            пытаться придумывать подсказки для двух и более кодовых имен. Объединить в одной
            подсказке сразу четыре кодовых имени&nbsp;— это успех!
          </div>
          <h4>ОДНО СЛОВО</h4>
          <div>Ваша подсказка должна состоять только из одного слова (существительного, глагола,
            прилагательного или любой другой части речи). Вы не можете давать никаких дополнительных
            подсказок или намеков. Например, нельзя говорить: «Это немного притянуто за уши…». Вы
            играете в «Кодовые имена», тут все будет притянуто за уши. Ваша подсказка не может быть
            кодовым именем, которое на данный момент выложено на столе. Однако позже, когда
            некоторые кодовые имена будут отгаданы, их можно будет использовать в качестве подсказок.
          </div>
          <h3>УСТАНОВЛЕНИЕ КОНТАКТА</h3>
          <div>Как только капитан дает подсказку, его игроки пытаются выяснить, что она обозначает. Они
            могут обсуждать это вслух между собой, но капитан обязан сохранять невозмутимый вид.
            Чтобы обозначить окончательное решение, один из игроков касается выбранного кодового
            имени на столе.
          </div>
          <div>
            <ul>
              <li>Если игрок касается <b>карточки, принадлежащей его команде</b>, капитан накрывает ее
                карточкой агента соответствующего цвета. <b>Команда может отгадывать следующее кодовое
                  имя</b>, если не исчерпала свои попытки.
              </li>
              <li>Если игрок касается <b>мирного жителя</b>, капитан накрывает его карточкой мирного жителя.
                <b>Ход переходит к другой команде</b>.
              </li>
              <li>Если игрок касается <b>карточки, принадлежащей другой команде</b>, капитан накрывает ее
                карточкой агента другой команды. Ход переходит к другой команде.
              </li>
              <li>Если игрок касается <b>убийцы</b>, капитан накрывает его карточкой убийцы, что означает конец
                игры! <b>Команда, вскрывшая карточку убийцы, проигрывает.</b>
              </li>
            </ul>
          </div>
          <div><b>Совет:</b> перед тем как давать подсказку, убедитесь, что она никак не связана с убийцей</div>

          <h4>КОЛИЧЕСТВО ОТГАДОК</h4>
          <div><b>Игроки всегда должны дать хотя бы один ответ.</b> После любого неправильного ответа ход
            сразу переходит к другой команде, но если кодовое имя отгадано правильно, игроки могут
            продолжать отгадывать, пока не израсходуют свои подсказки (см. ниже).
          </div>
          <div><b>Команда может прекратить отгадывать кодовые имена в любой момент</b>, если она уже дала
            один ответ, и передать ход другой команде.
          </div>
          <div><b>Игроки могут дать на одну отгадку больше, чем число, названное капитаном.</b></div>
          <div class="text-marked">
            <div><b>Пример:</b> подсказкой красной команды было <b><i>«Балет:&nbsp;2»</i></b>. Игрок красной
              команды предположил, что это ШПАГАТ и ТАНЕЦ, первым было выбрано кодовое имя ШПАГАТ. Им оказался
              мирный житель, поэтому отгадать кодовое имя ТАНЕЦ игроку уже не удается.
            </div>
            <div>Ход перешел к синей команде. Она правильно отгадывает два кодовых имени. Теперь вновь
              очередь красной команды.
            </div>
            <div>Капитан красной команды говорит: <b><i>«Птица:&nbsp;3»</i></b>.
              Игрок красной команды уверен, что ГРИФ&nbsp;— это
              птица, поэтому касается карточки с этим кодовым именем. Капитан кладет на нее карточку
              красного агента, поэтому игрок продолжает отгадывать. У птицы есть КРЫЛО, следовательно,
              игрок касается этого кодового имени. Это вновь красный агент, а значит, игрок может коснуться
              еще одной карточки.
            </div>
            <div>Однако он не уверен в кодовом имени, относящемся к птице, поэтому выбирает ТАНЕЦ. Это
              кодовое имя не имеет ничего общего с птицей&nbsp;— игрок отгадывает кодовое имя, относящееся
              к предыдущей подсказке. ТАНЕЦ оказывается агентом красной команды. Игроки правильно отгадали
              три кодовых имени по подсказке <b><i>«Птица:&nbsp;3»</i></b>.
              Теперь они могут отгадать третье кодовое имя, относящееся к птице, либо
              попробовать найти кодовое имя, относящееся к балету. Также они могут остановиться
              на трех отгаданных кодовых именах и передать ход синей команде.
            </div>
          </div>
          <div>В результате у игроков красной команды была возможность
            отгадать 4 кодовых имени, потому что их капитан назвал число 3.
          </div>
          <div>Когда игроки говорят, что они закончили отгадывать или
            отгадали неверное кодовое имя, наступает очередь другой команды.
          </div>
          <h3>ПОСЛЕДУЮЩИЕ ХОДЫ</h3>
          <div>Капитаны по очереди дают подсказки. В
            течение каждого хода отгадывается хотя
            бы одно кодовое имя, поэтому отгадывать
            постепенно становится все проще и проще.
          </div>

          <h3>ОКОНЧАНИЕ ИГРЫ</h3>
          <div>
            <b>Игра заканчивается, когда одна из команд
              раскрыла всех своих агентов. Эта команда
              побеждает.</b>
          </div>
          <div>
            Выиграть также можно в течение хода другой команды&nbsp;— если та раскрывает вашего
            последнего агента.
          </div>
          <div>
            Игра может закончиться раньше в случае,
            если игрок наталкивается на убийцу. Команда этого игрока проигрывает.
          </div>
        </div>
      </div>

      <div class="rule-card mt-5">
        <div class="rule-card-body">
          <h1>НАКАЗАНИЕ ЗА НЕКОРРЕКТНЫЕ ПОДСКАЗКИ</h1>
          <div>
            Если капитан дает некорректную подсказку,
            ход сразу же переходит к другой команде.
            В качестве дополнительного наказания
            капитан другой команды может накрыть
            одно из их кодовых имен карточкой агента
            перед тем, как даст подсказку. Однако
            если никто не заметил, что подсказка была
            неправильной, она считается корректной.
          </div>
        </div>
      </div>

      <div class="rule-card mt-5">
        <div class="rule-card-body">
          <h1>СОХРАНЯЙТЕ НЕВОЗМУТИМЫЙ ВИД</h1>
          <div>
            Капитаны должны сохранять невозмутимое
            выражение лица. Не тянитесь к карточкам,
            пока игроки принимают решение.
            Когда член вашей команды касается кодового
            имени, сверьтесь с ключом и накройте
            это кодовое имя карточкой нужного цвета.
            Если ваш игрок выбирает кодовое имя
            правильного цвета, вы должны делать вид,
            что именно его вы и имели в виду, даже
            если это совсем не так. Если вы игрок, вы
            должны сосредоточить свое внимание на
            карточках с кодовыми именами. Не пытайтесь
            установить зрительный контакт
            с вашим капитаном, пока вы пытаетесь
            отгадать кодовое имя,&nbsp;— это поможет вам
            избежать невербальных подсказок. Когда
            вы обладаете строго ограниченным количеством
            информации в виде одного слова
            и одной цифры, вы играете так, как полагается.
          </div>
        </div>
      </div>


      <div class="rule-card mt-5">
        <div class="rule-card-body">
          <h1>КОРРЕКТНЫЕ ПОДСКАЗКИ</h1>
          <div>Мы тестировали разные варианты правил. Кому-то нравятся одни правила,
            кому-то&nbsp;— другие.
            Экспериментируйте, чтобы понять, какой вариант вам подходит больше всего.
          </div>
          <div class="row justify-content-around mt-3">
            <div class="col-12 col-xl-5">
              <h3>ОБЯЗАТЕЛЬНЫЕ УСЛОВИЯ</h3>
              <div>
                <div>Некоторые подсказки считаются некорректными,
                  поскольку противоречат духу игры.
                </div>
                <div><b>Ваша подсказка должна отражать значение
                  кодового имени.</b> Нельзя использовать
                  подсказку для обозначения букв в кодовом
                  имени или расположения карточек на
                  столе. <span class="text-marked"><b><i>«Рация»</i></b></span>
                  не может быть подсказкой
                  для кодового имени ОПЕРАЦИЯ. Кодовые
                  имена НАЛЕТ, НОМЕР и НАРЯД не могут
                  быть объединены ни подсказкой
                  <span class="text-marked"><b><i>«Н:&nbsp;3»</i></b></span>, ни
                  <span class="text-marked"><b><i>«Пять:&nbsp;3»</i></b></span>.
                </div>
                <div><i>Тем не менее…</i></div>
                <div>
                  <b>Буквы и цифры могут быть корректными
                    подсказками, если они отражают значения
                    кодовых имен.</b> Вы можете использовать
                  <span class="text-marked"><b><i>«О:&nbsp;1»</i></b></span>
                  в качестве подсказки для кодового
                  имени КРУГ. Вы также можете использовать
                  <span class="text-marked"><b><i>«Восемь:&nbsp;3»</i></b></span>
                  в качестве подсказки для ШАР,
                  НОМЕР И ОСЬМИНОГ.
                </div>
                <div>
                  <b>Цифра, идущая за основной подсказкой,
                    не может быть использована в качестве
                    подсказки. </b>
                  <span class="text-marked"><b><i>«Фрукт:&nbsp;8»</i></b></span>
                  &nbsp;— некорректная
                  подсказка для кодовых имен ГРУША и
                  ОСЬМИНОГ.
                </div>
                <div><b>Вы должны играть на русском.</b>
                  Иностранное слово может быть использовано
                  при условии, что его употребляют в повседневной
                  жизни, говоря на русском языке. Например,
                  вы не можете использовать
                  <span class="text-marked"><b><i>«Apfel»</i></b></span>
                  (немецкое слово) в качестве подсказки для кодовых
                  имен ЯБЛОКО и БЕРЛИН, но вы можете
                  использовать слово
                  <span class="text-marked"><b><i>«штрудель»</i></b></span>.
                </div>
                <div>
                  <b>Запрещается использование любых форм
                    слова, выложенного как кодовое имя и не
                    накрытого другой карточкой.</b> Пока поверх
                  кодового имени СВЕТ не лежит другая карточка,
                  вы не можете использовать
                  <span class="text-marked"><b><i>«светлый»</i></b></span>,
                  <span class="text-marked"><b><i>«пересвет»</i></b></span>,
                  <span class="text-marked"><b><i>«подсветка»</i></b></span>,
                  <span class="text-marked"><b><i>«светотень»</i></b></span>
                  и др.
                </div>
                <div>
                  <b>Нельзя использовать части сложных слов,
                    выложенных как кодовое имя.</b> Пока кодовое
                  имя СУПЕРГЕРОЙ не накрыто карточкой, нельзя использовать слова
                  <span class="text-marked"><b><i>«герой»</i></b></span>,
                  <span class="text-marked"><b><i>«супер»</i></b></span>,
                  <span class="text-marked"><b><i>«антигерой»</i></b></span>
                  или <span class="text-marked"><b><i>«суперсила»</i></b></span>.
                </div>
              </div>
            </div>
            <div class="col-12 col-xl-5">

              <div class="row">
                <div class="col-12">
                  <h3>ОМОФОНЫ, ОМОНИМЫ И ОМОГРАФЫ</h3>
                  <div>
                    <div>В русском языке довольно много омофонов.
                      Например, слова «рот» и «род» звучат
                      одинаково, но обозначают разные вещи.
                    </div>
                    <div><b>Слова, одинаковые по звучанию, но разные
                      по написанию и значению, считаются
                      разными словами (омофоны).</b> Поэтому вы
                      не можете давать подсказки, имеющие отношение
                      к слову <span class="text-marked"><b><i>«рот»</i></b></span>,
                      для кодового имени РОД.
                    </div>
                    <div>
                      <b>Слова, одинаковые по написанию, считаются
                        одним и тем же словом, даже если у них
                        разное произношение (омографы) или если
                        они отличаются по значению (омонимы).</b>
                      Например, при помощи косы мы скашиваем траву,
                      а золотистые волосы Рапунцель
                      были заплетены в длинную <span class="text-marked">косу</span>,
                      поэтому слово <span class="text-marked"><b><i>«коса»</i></b></span>
                      может служить подсказкой
                      для кодовых имен ТРАВА и ПРИНЦЕССА.
                    </div>
                    <div><b>Вы можете произносить свои подсказки по
                      буквам.</b> Например, вы хотите, чтобы ваша
                      команда отгадала кодовые имена РЫЦАРЬ
                      и КЛЮЧ, для этого вы можете произнести
                      <span class="text-marked"><b><i>«з-а-м-о-к»</i></b></span>,
                      не делая ударений в слове.
                    </div>
                    <div>
                      <b>Вы должны произнести слово по буквам,
                        если кто-то вас об этом просит.</b> Если вы не
                      сильны в орфографии, попросите капитана
                      другой команды помочь вам.
                    </div>
                    <div>
                      Совет: произношение слов по буквам может
                      пригодиться не только для омографов. Это
                      может быть полезным, если в месте, где вы
                      играете, очень шумно или у игроков разные
                      акценты.
                    </div>
                  </div>
                </div>

                <div class="col-12">
                  <h3>НЕ БУДЬТЕ СЛИШКОМ СТРОГИ</h3>
                  <div>
                    Тот, кто говорит, что вы не можете использовать
                    слово <span class="text-marked"><b><i>«медведь»</i></b></span>,
                    пока кодовое имя МЁД открыто, просто хочет вам помешать.
                    Если капитан команды соперников разрешает вам
                    использовать слово, значит, подсказка считается корректной. Если вы не
                    уверены в корректности своей подсказки,
                    посоветуйтесь с другим капитаном (только
                    шепотом, чтобы никто не слышал).
                  </div>

                </div>
              </div>
            </div>

          </div>
        </div>
      </div>

      <div class="rule-card mt-5">
        <div class="rule-card-body">
          <div class="row justify-content-around mt-3">
            <div class="col-12 col-xl-5">
              <h1>ПРОДВИНУТАЯ ПОДСКАЗКА: НОЛЬ</h1>
              <div>
                Вы можете использовать 0 в качестве
                части вашей подсказки. Например
                <span class="text-marked"><b><i>«Перья:&nbsp;0»</i></b></span>
                означает, что ни одно из представленных
                кодовых имен не относится к
                слову <span class="text-marked"><b><i>«перья»</i></b></span>.
                Если капитан называет число 0,
                это значит, что игроки могут отгадать
                столько кодовых имен, сколько захотят.
                Они по-прежнему должны попытаться отгадать
                хотя бы одно кодовое имя. Если вы
                еще не поняли, каким образом такой вариант
                подсказки может быть полезен, не переживайте, вы поймете это позже.
              </div>

            </div>

            <div class="col-12 col-xl-5">
              <h1>ПРОДВИНУТАЯ ПОДСКАЗКА: НЕОГРАНИЧЕННО</h1>
              <div>
                Время от времени у вас могут оставаться
                несколько неотгаданных кодовых имен
                от подсказок с предыдущих ходов. Если
                вы хотите, чтобы ваша команда отгадала
                эти кодовые имена, вы можете сказать
                «Неограниченно» вместо числа. Например:
                <span class="text-marked"><b><i>«Перья:&nbsp;неограниченно»</i></b></span>.
                Недостаток заключается в том, что игроки не знают,
                сколько кодовых имен относится к новой
                подсказке. Преимущество в том, что нет
                лимита подсказки, и они могут отгадать
                столько кодовых имен, сколько захотят.
              </div>
            </div>

          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    name: "Rules"
  }
</script>

<style scoped lang="scss">

  $caption-color: #bb2525;
  $secondary-caption-color: #670034;
  $mark-color: #50145c;

  .text-marked {
    color: $mark-color;
  }

  .rule-card {
    min-height: 150px;
    position: relative;
    background: #f3f3f3;
    background: -webkit-gradient(linear, 0% 20%, 0% 92%, from(#f3f3f3), to(#f0f0f0), color-stop(.1, #f3f3f3));
    border-top: 1px solid #cecece;
    border-right: 1px solid #cecece;
    border-left: 1px solid #cecece;
    -webkit-box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
    -moz-box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
    box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);

    text-align: justify;

    &-body {
      padding: 2em 2.5em 2em 2.5em;

      & h1 {
        color: $caption-color;
        font-weight: 700;
        text-align: center;
      }

      & h3 {
        padding-top: 1rem;
        color: $secondary-caption-color;
        border-bottom: 0.05em solid $secondary-caption-color;
      }

      & h4 {
        padding-top: 0.5rem;
        margin-bottom: 0;
        color: $mark-color;
      }

    }

    /* Это верхняя левая ленточка */
    &:before {
      content: '';
      position: absolute;
      width: 130px;
      height: 30px;
      border-left: 1px dashed rgba(0, 0, 0, 0.1);
      border-right: 1px dashed rgba(0, 0, 0, 0.1);
      background: rgba(0, 0, 0, 0.1);
      background: -webkit-gradient(linear, 555% 20%, 0% 92%, from(rgba(0, 0, 0, 0.1)), to(rgba(0, 0, 0, 0.0)), color-stop(.1, rgba(0, 0, 0, 0.2)));
      -webkit-box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
      -moz-box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
      box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
      -webkit-transform: translate(-50px, 10px) skew(10deg, 10deg) rotate(-50deg);
      -moz-transform: translate(-50px, 10px) skew(10deg, 10deg) rotate(-50deg);
      -o-transform: translate(-50px, 10px) skew(10deg, 10deg) rotate(-50deg);
      transform: translate(-50px, 10px) skew(10deg, 10deg) rotate(-50deg);
    }

    /* Это правая нижняя ленточка */
    &:after {
      content: '';
      position: absolute;
      right: 0;
      bottom: 0;
      width: 130px;
      height: 30px;
      background: rgba(0, 0, 0, 0.1);
      background: -webkit-gradient(linear, 555% 20%, 0% 92%, from(rgba(0, 0, 0, 0.1)), to(rgba(0, 0, 0, 0.0)), color-stop(.1, rgba(0, 0, 0, 0.2)));
      border-left: 1px dashed rgba(0, 0, 0, 0.1);
      border-right: 1px dashed rgba(0, 0, 0, 0.1);
      -webkit-box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
      -moz-box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
      box-shadow: 0px 0px 12px rgba(0, 0, 0, 0.2);
      -webkit-transform: translate(50px, -20px) skew(10deg, 10deg) rotate(-50deg);
      -moz-transform: translate(50px, -20px) skew(10deg, 10deg) rotate(-50deg);
      -o-transform: translate(50px, -20px) skew(10deg, 10deg) rotate(-50deg);
      transform: translate(50px, -20px) skew(10deg, 10deg) rotate(-50deg)
    }
  }
</style>
